benchmark/out/grpc_rps_100_n_1.txt

Summary:
  Count:	139
  Total:	10.00 s
  Slowest:	1.01 s
  Fastest:	449.27 ms
  Average:	714.26 ms
  Requests/sec:	13.91

Response time histogram:
  449.274  [1]  |∎
  504.929  [1]  |∎
  560.585  [3]  |∎∎∎∎
  616.241  [4]  |∎∎∎∎∎∎
  671.896  [19] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  727.552  [28] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  783.208  [25] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  838.863  [23] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  894.519  [13] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  950.175  [9]  |∎∎∎∎∎∎∎∎∎∎∎∎∎
  1005.830 [3]  |∎∎∎∎

Latency distribution:
  10 % in 637.99 ms 
  25 % in 682.20 ms 
  50 % in 744.89 ms 
  75 % in 823.87 ms 
  90 % in 888.83 ms 
  95 % in 917.72 ms 
  99 % in 987.76 ms 

Status code distribution:
  [OK]            129 responses   
  [Unavailable]   10 responses    

Error distribution:
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36264->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36336->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36304->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36346->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36348->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36288->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36320->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36300->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36276->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:36262->127.0.0.1:50051: use of closed network connection