benchmark/out/grpc_rps_100_n_2.txt

Summary:
  Count:	161
  Total:	9.99 s
  Slowest:	890.50 ms
  Fastest:	535.04 ms
  Average:	616.31 ms
  Requests/sec:	16.11

Response time histogram:
  535.035 [1]  |∎
  570.582 [8]  |∎∎∎∎∎∎∎∎
  606.128 [40] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  641.674 [38] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  677.221 [33] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  712.767 [16] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  748.313 [9]  |∎∎∎∎∎∎∎∎∎
  783.860 [1]  |∎
  819.406 [1]  |∎
  854.952 [2]  |∎∎
  890.499 [2]  |∎∎

Latency distribution:
  10 % in 574.81 ms 
  25 % in 594.84 ms 
  50 % in 627.97 ms 
  75 % in 673.38 ms 
  90 % in 712.29 ms 
  95 % in 731.67 ms 
  99 % in 872.75 ms 

Status code distribution:
  [OK]            151 responses   
  [Unavailable]   10 responses    

Error distribution:
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:53032->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:53030->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:53048->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:53078->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:53038->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:53040->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:53028->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:53034->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:53036->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:53044->127.0.0.1:50051: use of closed network connection