benchmark/out/grpc_rps_250_n_1.txt

Summary:
  Count:	145
  Total:	10.00 s
  Slowest:	1.02 s
  Fastest:	433.72 ms
  Average:	687.24 ms
  Requests/sec:	14.51

Response time histogram:
  433.718  [1]  |∎
  492.326  [1]  |∎
  550.935  [0]  |
  609.543  [5]  |∎∎∎∎
  668.152  [43] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  726.760  [46] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  785.369  [16] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  843.978  [6]  |∎∎∎∎∎
  902.586  [9]  |∎∎∎∎∎∎∎∎
  961.195  [5]  |∎∎∎∎
  1019.803 [3]  |∎∎∎

Latency distribution:
  10 % in 621.73 ms 
  25 % in 650.74 ms 
  50 % in 686.00 ms 
  75 % in 744.62 ms 
  90 % in 868.26 ms 
  95 % in 918.37 ms 
  99 % in 987.11 ms 

Status code distribution:
  [OK]            135 responses   
  [Unavailable]   10 responses    

Error distribution:
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:35358->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:35282->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:35296->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:35332->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:35362->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:35272->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:35310->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:35326->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:35320->127.0.0.1:50051: use of closed network connection   
  [1]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:35348->127.0.0.1:50051: use of closed network connection